alpha_0.7/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
13630
(
( 5.041104305e-05 -1.524315849e-05 1.985370943e-07 2.036514343e-05 1.064939852e-07 2.504128315e-05 )
( 4.503996024e-05 -1.321571472e-05 3.036986413e-07 1.841435733e-05 1.648298849e-07 2.185994344e-05 )
( 5.149993012e-05 -1.553587026e-05 2.345023802e-07 2.05468823e-05 2.065054758e-07 2.54155384e-05 )
( 4.079649443e-05 -1.163928027e-05 4.436307108e-07 1.705951581e-05 1.297117649e-07 1.961903763e-05 )
( 4.551671736e-05 -1.337858248e-05 3.182232717e-07 1.851342495e-05 2.46876624e-07 2.199023584e-05 )
( 5.227390648e-05 -1.575092756e-05 2.472101244e-07 2.05811557e-05 2.800039454e-07 2.557161133e-05 )
( 3.708114673e-05 -1.040979805e-05 5.03692263e-07 1.598944618e-05 8.829666598e-08 1.792350668e-05 )
( 4.108740904e-05 -1.177382455e-05 4.46027741e-07 1.714391692e-05 2.064287514e-07 1.968023935e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
