alpha_0.7/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
13630
(
( 0.02404325083 -0.002017197432 -0.0001174266363 )
( 0.02523639239 -0.001845031627 -8.165611507e-05 )
( 0.02374783158 -0.002001550514 -0.0001216958699 )
( 0.02621177025 -0.001685056835 -3.41784762e-05 )
( 0.02504726127 -0.001815342344 -7.903106598e-05 )
( 0.02353388444 -0.001961099217 -0.000116903313 )
( 0.02704359964 -0.001536150579 1.910025094e-05 )
( 0.02604175545 -0.001654335996 -2.829117511e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
