alpha_0.7/0/V
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
13630
(
0.001006106328
0.001083293133
0.00100615292
0.001145022728
0.001083325069
0.001006244061
0.001153080798
0.001145045891
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform 0;
    }
    top-wall
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
