alpha_0.7/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/




FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hill
    {
        type            wall;
        inGroups        1(wall);
        nFaces          668;
        startFace       27143;
    }
    top-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          126;
        startFace       27811;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13630;
        startFace       27937;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13630;
        startFace       41567;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          45;
        startFace       55197;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  cyclicAMI_inlet;
        separationVector ( -6.3 0 0 );
        lowWeightCorrection 0.01;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          45;
        startFace       55242;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  cyclicAMI_outlet;
        separationVector ( 6.3 0 0 );
        lowWeightCorrection 0.01;
    }
)

// ************************************************************************* //
